{"_type":"testimonial","_id":"test-1","name":"Sarah Johnson","position":"CEO","company":"TechStart Inc","testimonial":"John is an exceptional developer who delivered our AI-powered platform ahead of schedule. His expertise in React and Node.js helped us build a scalable solution that our users love. The code quality and documentation were outstanding. Highly recommended!","rating":5,"date":"2023-11-20","linkedinUrl":"https://linkedin.com/in/sarahjohnson","featured":true,"order":1}
{"_type":"testimonial","_id":"test-2","name":"Michael Chen","position":"CTO","company":"DataFlow Solutions","testimonial":"Working with John was a game-changer for our company. He architected and built our entire analytics platform from scratch, implementing real-time features that our competitors couldn't match. His technical leadership and problem-solving skills are top-notch.","rating":5,"date":"2023-10-15","linkedinUrl":"https://linkedin.com/in/michaelchen","featured":true,"order":2}
{"_type":"testimonial","_id":"test-3","name":"Emily Rodriguez","position":"Product Manager","company":"AI Innovations","testimonial":"John's ability to integrate complex AI features into our product was impressive. He not only handled the technical implementation flawlessly but also provided valuable insights into UX and product strategy. A true full-stack professional.","rating":5,"date":"2023-09-10","linkedinUrl":"https://linkedin.com/in/emilyrodriguez","featured":true,"order":3}
{"_type":"testimonial","_id":"test-4","name":"David Park","position":"Founder","company":"ShopEase","testimonial":"Our e-commerce platform wouldn't exist without John's expertise. He built a beautiful, fast, and conversion-optimized online store that exceeded our expectations. Sales increased by 150% in the first month after launch!","rating":5,"date":"2023-08-25","linkedinUrl":"https://linkedin.com/in/davidpark","featured":true,"order":4}
{"_type":"testimonial","_id":"test-5","name":"Lisa Thompson","position":"VP of Engineering","company":"CloudScale","testimonial":"John joined our team as a consultant and immediately added value. His code reviews were insightful, his architecture recommendations were spot-on, and he mentored our junior developers with patience and expertise. Would work with him again in a heartbeat.","rating":5,"date":"2023-07-15","linkedinUrl":"https://linkedin.com/in/lisathompson","featured":true,"order":5}
{"_type":"testimonial","_id":"test-6","name":"Robert Kim","position":"Director of Technology","company":"HealthTech Solutions","testimonial":"John's work on our HIPAA-compliant healthcare platform was exemplary. He understood the security requirements and implemented robust solutions while maintaining excellent performance. His attention to detail and commitment to quality were remarkable.","rating":5,"date":"2023-06-05","featured":false,"order":6}
{"_type":"testimonial","_id":"test-7","name":"Amanda Martinez","position":"Marketing Director","company":"ContentHub","testimonial":"As a non-technical person, I was impressed by how well John communicated throughout our project. He explained complex concepts clearly and delivered exactly what we needed. The AI content generator he built has transformed our workflow.","rating":5,"date":"2023-05-20","featured":false,"order":7}
{"_type":"testimonial","_id":"test-8","name":"James Wilson","position":"Co-founder","company":"TaskFlow","testimonial":"John's contribution to our SaaS platform was invaluable. He not only wrote clean, maintainable code but also set up our entire DevOps pipeline and taught our team best practices. A true professional who cares about the long-term success of the projects he works on.","rating":5,"date":"2023-04-10","featured":false,"order":8}
